OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_I2C.c
//	printf("I2C master status %x\n", u32Status);
    switch(u32Status) {
    case 0x08u:	//Start
        if(psParam->u8DataAddrLen)
            I2C_SET_DATA(i2c, (uint8_t)((psParam->u8SlaveAddr << 1u) | 0x00u));		/* Write SLA+W to Register I2CDAT */
        else
            I2C_SET_DATA(i2c, (uint8_t)((psParam->u8SlaveAddr << 1u) | psPriv->u8TransRx));		/* Write SLA+W or SLA+R to Register I2CDAT */
        u8Ctrl = I2C_CTL_SI;                               			/* Clear SI */
        break;
    case 0x10u:	//Master Repeat start
        I2C_SET_DATA(i2c, (uint8_t)((psParam->u8SlaveAddr << 1u) | psPriv->u8TransRx));    /* Write SLA+R to Register I2CDAT */
        u8Ctrl = I2C_CTL_SI;                               /* Clear SI */
        break;
    case 0x18u:	//Master transmit address ACK (for TX access or data address stage)
        u8Ctrl = I2C_CTL_SI;                               /* Clear SI */

        if(psParam == NULL) {
            u8Ctrl = I2C_CTL_STO_SI;
        } else if(psParam->u8DataAddrLen) {
            I2C_SET_DATA(i2c, psParam->pu8DataAddr[psPriv->u8DataAddrTrans]);                          /* Write data to I2CDAT */

            psParam->u8DataAddrLen --;
            psPriv->u8DataAddrTrans ++;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                I2C_SET_DATA(i2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */
                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = I2C_CTL_STO_SI;
        }
        break;
    case 0x20u:	// Master transmit address NACK
    case 0x30u: // Master transmit data NACK
        psPriv->u8EndFlag = 1;
        u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
        break;
    case 0x28u:	// Master transmit data ACK
        u8Ctrl = I2C_CTL_SI;                               /* Clear SI */
        if(psParam->u8DataAddrLen) {
            I2C_SET_DATA(i2c, psParam->pu8DataAddr[psPriv->u8DataAddrTrans]);                          /* Write data to I2CDAT */

            psParam->u8DataAddrLen --;
            psPriv->u8DataAddrTrans ++;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                I2C_SET_DATA(i2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */

                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;
            } else {	//RX access
                u8Ctrl = I2C_CTL_STA_SI;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = I2C_CTL_STO_SI;
        }

        break;
    case 0x40u: //Master receive addresss ACK
        if(psParam == NULL)
            u8Ctrl = I2C_CTL_SI;
        else if(psParam->u32DataLen > 1)
            u8Ctrl = I2C_CTL_SI_AA; 	/* Clear SI and set ACK */
        else
            u8Ctrl = I2C_CTL_SI;        /* Clear SI */
        break;
    case 0x50u:	//Master receive data ACK
        if(psParam->u32DataLen) {
            psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) I2C_GET_DATA(i2c);
            psPriv->u32DataTrans ++;
            psParam->u32DataLen --;
        }

        if(psParam->u32DataLen > 1) {
            u8Ctrl = I2C_CTL_SI_AA;                             /* Clear SI and set ACK */
        } else {
            u8Ctrl = I2C_CTL_SI;                                /* Clear SI */
        }
        break;
    case 0x58u:	//Master receive NACK
        if(psParam->u32DataLen) {
            psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) I2C_GET_DATA(i2c);
            psPriv->u32DataTrans ++;
            psParam->u32DataLen --;
        }

        u8Ctrl = I2C_CTL_STO_SI;                                /* Clear SI and send STOP */
        psPriv->u8EndFlag = 1;
        break;
    case 0x38u:                                             /* Arbitration Lost */
    default:                                                /* Unknow status */
        u8Ctrl = I2C_CTL_STO_SI;                                /* Clear SI and send STOP */
        psPriv->u8EndFlag = 1;
        printf("I2C transfer arbitration lost or unknow status \n");
        break;
    }
    I2C_SET_CONTROL_REG(i2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
    psPriv->u8State = u32Status;

}

static void _LPI2C_MasterRxTx_IRQ(void *pvI2C, uint32_t u32Status, I2C_TRANS_PARAM *psParam, I2C_TRANS_PRIV *psPriv)
{
    LPI2C_T *lpi2c = (LPI2C_T *)pvI2C;
    uint8_t u8Ctrl = 0u;

    if(psPriv == NULL) {
        u8Ctrl = LPI2C_CTL_STO_SI;
        LPI2C_SET_CONTROL_REG(lpi2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
        return;
    }

//	printf("I2C master status %x\n", u32Status);
    switch(u32Status) {
    case 0x08u:	//Start
        if(psParam->u8DataAddrLen)
            LPI2C_SET_DATA(lpi2c, (uint8_t)((psParam->u8SlaveAddr << 1u) | 0x00u));		/* Write SLA+W to Register I2CDAT */
        else
            LPI2C_SET_DATA(lpi2c, (uint8_t)((psParam->u8SlaveAddr << 1u) | psPriv->u8TransRx));		/* Write SLA+W or SLA+R to Register I2CDAT */
        u8Ctrl = LPI2C_CTL_SI;                               			/* Clear SI */
        break;
    case 0x10u:	//Master Repeat start
        LPI2C_SET_DATA(lpi2c, (uint8_t)((psParam->u8SlaveAddr << 1u) | psPriv->u8TransRx));    /* Write SLA+R to Register I2CDAT */
        u8Ctrl = LPI2C_CTL_SI;                               /* Clear SI */
        break;
    case 0x18u:	//Master transmit address ACK (for TX access or data address stage)
        u8Ctrl = LPI2C_CTL_SI;                               /* Clear SI */

        if(psParam == NULL) {
            u8Ctrl = LPI2C_CTL_STO_SI;
        } else if(psParam->u8DataAddrLen) {
            LPI2C_SET_DATA(lpi2c, psParam->pu8DataAddr[psPriv->u8DataAddrTrans]);                          /* Write data to I2CDAT */

            psParam->u8DataAddrLen --;
            psPriv->u8DataAddrTrans ++;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                LPI2C_SET_DATA(lpi2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */
                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = LPI2C_CTL_STO_SI;
        }
        break;
    case 0x20u:	// Master transmit address NACK
    case 0x30u: // Master transmit data NACK
        psPriv->u8EndFlag = 1;
        u8Ctrl = LPI2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
        break;
    case 0x28u:	// Master transmit data ACK
        u8Ctrl = LPI2C_CTL_SI;                               /* Clear SI */
        if(psParam->u8DataAddrLen) {
            LPI2C_SET_DATA(lpi2c, psParam->pu8DataAddr[psPriv->u8DataAddrTrans]);                          /* Write data to I2CDAT */

            psParam->u8DataAddrLen --;
            psPriv->u8DataAddrTrans ++;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                LPI2C_SET_DATA(lpi2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */

                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;
            } else {	//RX access
                u8Ctrl = LPI2C_CTL_STA_SI;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = LPI2C_CTL_STO_SI;
            u8Ctrl = LPI2C_CTL_STO_SI;
        }

        break;
    case 0x40u: //Master receive addresss ACK
        if(psParam == NULL)
            u8Ctrl = LPI2C_CTL_SI;
        else if(psParam->u32DataLen > 1)
            u8Ctrl = LPI2C_CTL_SI_AA; 	/* Clear SI and set ACK */
        else
            u8Ctrl = LPI2C_CTL_SI;        /* Clear SI */
        break;
    case 0x50u:	//Master receive data ACK
        if(psParam->u32DataLen) {
            psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) LPI2C_GET_DATA(lpi2c);
            psPriv->u32DataTrans ++;
            psParam->u32DataLen --;
        }

