OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_I2C.c
        if(psParam->u32DataLen > 1) {
            u8Ctrl = LPI2C_CTL_SI_AA;                             /* Clear SI and set ACK */
        } else {
            u8Ctrl = LPI2C_CTL_SI;                                /* Clear SI */
        }
        break;
    case 0x58u:	//Master receive NACK
        if(psParam->u32DataLen) {
            psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) LPI2C_GET_DATA(lpi2c);
            psPriv->u32DataTrans ++;
            psParam->u32DataLen --;
        }

        u8Ctrl = LPI2C_CTL_STO_SI;                                /* Clear SI and send STOP */
        psPriv->u8EndFlag = 1;
        break;
    case 0x38u:                                             /* Arbitration Lost */
    default:                                                /* Unknow status */
        u8Ctrl = LPI2C_CTL_STO_SI;                                /* Clear SI and send STOP */
        psPriv->u8EndFlag = 1;
        printf("LPI2C transfer arbitration lost or unknow status \n");
        break;
    }
    LPI2C_SET_CONTROL_REG(lpi2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
    psPriv->u8State = u32Status;

}

static void _I2C_SlaveRxTx_IRQ(void *pvI2C, uint32_t u32Status, I2C_TRANS_PARAM *psParam, I2C_TRANS_PRIV *psPriv)
{
    uint8_t u8Ctrl = 0u;
    I2C_T *i2c = (I2C_T *)pvI2C;

    if(psPriv == NULL) {
        u8Ctrl = I2C_CTL_STO_SI;
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
        return;
    }

//	if(psPriv->u8TransRx == 0)
//		printf("I2C slave status %x\n", u32Status);

    switch(u32Status) {
    case 0xA0u:	//Slave transmit repeat start or stop
        u8Ctrl = I2C_CTL_SI_AA;                                /* Clear SI and set ACK*/

        if((psParam) && (psPriv->u32DataTrans))
            psPriv->u8EndFlag = 1;
        //printf("I2C slave transmit repeat start or stop\n");
        break;
    case 0xA8u:	//Slave transmit address ACK
        u8Ctrl = I2C_CTL_SI_AA;                               /* Clear SI and set  ACK*/

        if(psParam == NULL) {
            u8Ctrl = I2C_CTL_SI_AA;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                I2C_SET_DATA(i2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */
                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;
            } else {
                psPriv->u8EndFlag = 1;
                u8Ctrl = I2C_CTL_SI;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = I2C_CTL_STO_SI;
        }
        break;
    case 0xB8u:	//Slave transmit data ACK
        u8Ctrl = I2C_CTL_SI_AA;                               /* Clear SI */

        if(psParam == NULL) {
            u8Ctrl = I2C_CTL_SI;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                I2C_SET_DATA(i2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */
                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;

                if(psParam->u32DataLen == 0) {
                    u8Ctrl = I2C_CTL_SI;
                }
            } else {	//RX access
                u8Ctrl = I2C_CTL_STA_SI;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = I2C_CTL_SI;
        }

        break;
    case 0xC0u:	//Slave transmit data NACK
        if(psPriv->u32DataTrans)
            psPriv->u8EndFlag = 1;

        u8Ctrl = I2C_CTL_SI_AA;
        break;
    case 0xC8u:	//Slave transmit last data ACK
        psPriv->u8EndFlag = 1;
        u8Ctrl = I2C_CTL_SI_AA;
        break;
    case 0x60u:	//Slave receive address ACK
        u8Ctrl = I2C_CTL_SI_AA;
        break;
    case 0x80u:	//Slave receive data ACK
        if(psParam == NULL) {
            u8Ctrl = I2C_CTL_SI;
        } else {
            u8Ctrl = I2C_CTL_SI_AA;                             /* Clear SI and set ACK */

            if(psPriv->u8TransRx) {

                if(psParam->u32DataLen) {
                    psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) I2C_GET_DATA(i2c);
                    psPriv->u32DataTrans ++;
                    psParam->u32DataLen --;
                }

                if(psParam->u32DataLen) {
                    u8Ctrl = I2C_CTL_SI_AA;                             /* Clear SI and set ACK */
                } else {
                    u8Ctrl = I2C_CTL_SI;                                /* Clear SI */
                }

            }
        }
        break;
    case 0x88u:	//Slave receive data NACK
        if(psParam == NULL) {
            u8Ctrl = I2C_CTL_SI;
        } else {
            if(psParam->u32DataLen) {
                psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) I2C_GET_DATA(i2c);
                psPriv->u32DataTrans ++;
                psParam->u32DataLen --;
            }

            u8Ctrl = I2C_CTL_SI_AA;                                /* Clear SI and set AA*/
            psPriv->u8EndFlag = 1;
        }
        break;
    case 0xB0u: {	//Address transmit aribitration lost
        u8Ctrl = I2C_CTL_SI;                                /* Clear SI */
        printf("I2C slave transfer arbitration lost\n");
    }
    break;
    case 0x68u:	//Address receive aribitration lost
        u8Ctrl = I2C_CTL_SI;                                /* Clear SI */
        printf("I2C slave transfer arbitration lost\n");
        break;
    default:                                                /* Unknow status */
        u8Ctrl = I2C_CTL_SI;                                /* Clear SI and send STOP */
        psPriv->u8EndFlag = 1;
        printf("I2C slave transfer unknow status \n");
        break;
    }
    I2C_SET_CONTROL_REG(i2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
    psPriv->u8State = u32Status;
}

static void _LPI2C_SlaveRxTx_IRQ(void *pvI2C, uint32_t u32Status, I2C_TRANS_PARAM *psParam, I2C_TRANS_PRIV *psPriv)
{
    uint8_t u8Ctrl = 0u;
    LPI2C_T *lpi2c = (LPI2C_T *)pvI2C;

    if(psPriv == NULL) {
        u8Ctrl = LPI2C_CTL_STO_SI;
        LPI2C_SET_CONTROL_REG(lpi2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
        return;
    }

//	printf("LPI2C slave status %x\n", u32Status);
    switch(u32Status) {
    case 0xA0u:	//Slave transmit repeat start or stop
        u8Ctrl = LPI2C_CTL_SI_AA;                                /* Clear SI and set ACK*/

        if((psParam) && (psPriv->u32DataTrans))
            psPriv->u8EndFlag = 1;
//		printf("LPI2C slave transmit repeat start or stop\n");
        break;
    case 0xA8u:	//Slave transmit address ACK
        u8Ctrl = LPI2C_CTL_SI_AA;                               /* Clear SI and set  ACK*/

        if(psParam == NULL) {
            u8Ctrl = LPI2C_CTL_SI_AA;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                LPI2C_SET_DATA(lpi2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */

                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;
            } else {
                psPriv->u8EndFlag = 1;
                u8Ctrl = LPI2C_CTL_SI;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = LPI2C_CTL_STO_SI;
        }
        break;
    case 0xB8u:	//Slave transmit data ACK
        u8Ctrl = LPI2C_CTL_SI_AA;                               /* Clear SI */

        if(psParam == NULL) {
            u8Ctrl = LPI2C_CTL_SI;
        } else if(psParam->u32DataLen) {
            if(psPriv->u8TransRx == 0) {	//TX access
                LPI2C_SET_DATA(lpi2c, psParam->pu8Data[psPriv->u32DataTrans]);                          /* Write data to I2CDAT */

                psParam->u32DataLen --;
                psPriv->u32DataTrans ++;

                if(psParam->u32DataLen == 0) {
                    u8Ctrl = LPI2C_CTL_SI;
                }
            } else {	//RX access
                u8Ctrl = LPI2C_CTL_STA_SI;
            }
        } else {
            psPriv->u8EndFlag = 1;
            u8Ctrl = LPI2C_CTL_SI;
        }

        break;
    case 0xC0u:	//Slave transmit data NACK
        if(psPriv->u32DataTrans)
            psPriv->u8EndFlag = 1;

        u8Ctrl = LPI2C_CTL_SI_AA;
        break;
    case 0xC8u:	//Slave transmit last data ACK
        psPriv->u8EndFlag = 1;
        u8Ctrl = LPI2C_CTL_SI_AA;
        break;
    case 0x60u:	//Slave receive address ACK
        u8Ctrl = LPI2C_CTL_SI_AA;
        break;
    case 0x80u:	//Slave receive data ACK
        if(psParam == NULL) {
            u8Ctrl = LPI2C_CTL_SI;
        } else {
            u8Ctrl = LPI2C_CTL_SI_AA;                             /* Clear SI and set ACK */

            if(psPriv->u8TransRx) {
                if(psParam->u32DataLen) {
                    psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) LPI2C_GET_DATA(lpi2c);
                    psPriv->u32DataTrans ++;
                    psParam->u32DataLen --;
                }

                if(psParam->u32DataLen) {
                    u8Ctrl = LPI2C_CTL_SI_AA;                             /* Clear SI and set ACK */
                } else {
                    u8Ctrl = LPI2C_CTL_SI;                                /* Clear SI */
                }
            }
        }
        break;
    case 0x88u:	//Slave receive data NACK
        if(psParam == NULL) {
            u8Ctrl = LPI2C_CTL_SI;
        } else {
            if(psParam->u32DataLen) {
                psParam->pu8Data[psPriv->u32DataTrans] = (unsigned char) LPI2C_GET_DATA(lpi2c);
                psPriv->u32DataTrans ++;
                psParam->u32DataLen --;
            }

            u8Ctrl = LPI2C_CTL_SI_AA;                                /* Clear SI and set AA*/
            psPriv->u8EndFlag = 1;
        }
        break;
    case 0xB0u: {	//Address transmit aribitration lost
        u8Ctrl = LPI2C_CTL_SI;                                /* Clear SI */
        printf("LPI2C slave transfer arbitration lost\n");
    }
    break;
    case 0x68u:	//Address receive aribitration lost
        u8Ctrl = LPI2C_CTL_SI;                                /* Clear SI */
        printf("LPI2C slave transfer arbitration lost\n");
        break;
    default:                                                /* Unknow status */
        u8Ctrl = LPI2C_CTL_SI;                                /* Clear SI and send STOP */
        psPriv->u8EndFlag = 1;
        printf("LPI2C slave transfer unknow status \n");
        break;
    }
    LPI2C_SET_CONTROL_REG(lpi2c, u8Ctrl);                          /* Write controlbit to I2C_CTL register */
    psPriv->u8State = u32Status;
}


void Handle_I2C_Irq(I2C_T *i2c, uint32_t u32Status)
{

    const struct nu_modinit_s *modinit = get_modinit((uint32_t)i2c, i2c_modinit_tab);
    I2C_TRANS_HANDLER *psTransHandler = NULL;

