OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_I2C.c
    if(modinit == NULL)
        return;

    psTransHandler = (I2C_TRANS_HANDLER *)modinit->var;

    if((psTransHandler) && (psTransHandler->pfnTransIRQ)) {
        psTransHandler->pfnTransIRQ(i2c, u32Status, psTransHandler->psTransParam, &psTransHandler->sTransPriv);
    }
}

void Handle_LPI2C_Irq(LPI2C_T *lpi2c, uint32_t u32Status)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)lpi2c, i2c_modinit_tab);
    I2C_TRANS_HANDLER *psTransHandler = NULL;

    if(modinit == NULL)
        return;

    psTransHandler = (I2C_TRANS_HANDLER *)modinit->var;

    if((psTransHandler) && (psTransHandler->pfnTransIRQ)) {
        psTransHandler->pfnTransIRQ(lpi2c, u32Status, psTransHandler->psTransParam, &psTransHandler->sTransPriv);
    }
}

int32_t I2C_HookIRQHandler(
    i2c_t *psI2CObj,
    uint8_t u8Recv,
    uint8_t u8Master
)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)psI2CObj->u_i2c.i2c, i2c_modinit_tab);
    I2C_TRANS_HANDLER *psTransHandler = NULL;
    I2C_TRANS_PRIV *psTransPriv;

    if(modinit == NULL)
        return -1;

    psTransHandler = (I2C_TRANS_HANDLER *)modinit->var;

    psTransPriv = &psTransHandler->sTransPriv;

    if(psI2CObj->bLPI2C) {
        if(u8Master) {
            psTransHandler->pfnTransIRQ = _LPI2C_MasterRxTx_IRQ;
        } else {
            psTransHandler->pfnTransIRQ = _LPI2C_SlaveRxTx_IRQ;
            /* I2C enter no address SLV mode */
            LPI2C_SET_CONTROL_REG(psI2CObj->u_i2c.lpi2c, LPI2C_CTL_SI | LPI2C_CTL_AA);
        }
        LPI2C_EnableInt(psI2CObj->u_i2c.lpi2c);
    } else {
        if(u8Master) {
            psTransHandler->pfnTransIRQ = _I2C_MasterRxTx_IRQ;
        } else {
            psTransHandler->pfnTransIRQ = _I2C_SlaveRxTx_IRQ;
            /* I2C enter no address SLV mode */
            I2C_SET_CONTROL_REG(psI2CObj->u_i2c.i2c, I2C_CTL_SI | I2C_CTL_AA);
        }

        I2C_EnableInt(psI2CObj->u_i2c.i2c);
    }


    psTransHandler->bHookIRQ = 1;
    psTransPriv->u8TransRx = u8Recv;

    return 0;
}

int I2C_MaterSendRecv(
    i2c_t *psI2CObj,
    uint8_t u8Recv,
    I2C_TRANS_PARAM *psParam,
    uint32_t u32TimeOut
)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)psI2CObj->u_i2c.i2c, i2c_modinit_tab);
    I2C_TRANS_HANDLER *psTransHandler = NULL;
    I2C_TRANS_PRIV *psTransPriv;

    if(modinit == NULL)
        return -1;

    psTransHandler = (I2C_TRANS_HANDLER *)modinit->var;

    psTransPriv = &psTransHandler->sTransPriv;

    if(psTransPriv->u8InTrans)
        return -2;

    memset(psTransPriv, 0x0, sizeof(I2C_TRANS_PRIV));
    psTransPriv = &psTransHandler->sTransPriv;
    psTransPriv->u8InTrans = 1;
    psTransPriv->u8TransRx = u8Recv;
    psTransHandler->psTransParam = psParam;

    if(psI2CObj->bLPI2C) {
        psTransHandler->pfnTransIRQ = _LPI2C_MasterRxTx_IRQ;

        if(psTransHandler->bHookIRQ == 0)
            LPI2C_EnableInt(psI2CObj->u_i2c.lpi2c);

        LPI2C_START(psI2CObj->u_i2c.lpi2c);
    } else {
        psTransHandler->pfnTransIRQ = _I2C_MasterRxTx_IRQ;

        if(psTransHandler->bHookIRQ == 0)
            I2C_EnableInt(psI2CObj->u_i2c.i2c);

        I2C_START(psI2CObj->u_i2c.i2c);
    }

    uint32_t u32EndTick = mp_hal_ticks_ms() + u32TimeOut;

    while(1) {

        if(mp_hal_ticks_ms() > u32EndTick) {
            break;
        }

        if(psTransPriv->u8EndFlag) {
//			printf("I2C master end state %x \n", psTransPriv->u8State);
            break;
        }

        MICROPY_THREAD_YIELD();
    }

    if(psTransHandler->bHookIRQ == 0) {
        if(psI2CObj->bLPI2C) {
            LPI2C_DisableInt(psI2CObj->u_i2c.lpi2c);
        } else {
            I2C_DisableInt(psI2CObj->u_i2c.i2c);
        }
    }

    psTransHandler->psTransParam = NULL;
    psTransPriv->u8InTrans = 0;

    return psTransPriv->u32DataTrans;
}

int I2C_SlaveSendRecv(
    i2c_t *psI2CObj,
    uint8_t u8Recv,
    I2C_TRANS_PARAM *psParam,
    uint32_t u32TimeOut
)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)psI2CObj->u_i2c.i2c, i2c_modinit_tab);
    I2C_TRANS_HANDLER *psTransHandler = NULL;
    I2C_TRANS_PRIV *psTransPriv;

    if(modinit == NULL)
        return -1;

    psTransHandler = (I2C_TRANS_HANDLER *)modinit->var;

    psTransPriv = &psTransHandler->sTransPriv;

    if(psTransPriv->u8InTrans)
        return -2;


    memset(psTransPriv, 0x0, sizeof(I2C_TRANS_PRIV));
    psTransPriv->u8InTrans = 1;
    psTransPriv->u8TransRx = u8Recv;
    psTransHandler->psTransParam = psParam;

    if(psI2CObj->bLPI2C) {
        /* I2C enter no address SLV mode */
        LPI2C_SET_CONTROL_REG(psI2CObj->u_i2c.lpi2c, LPI2C_CTL_SI | LPI2C_CTL_AA);

        psTransHandler->pfnTransIRQ = _LPI2C_SlaveRxTx_IRQ;

        if(psTransHandler->bHookIRQ == 0)
            LPI2C_EnableInt(psI2CObj->u_i2c.lpi2c);

    } else {
        /* I2C enter no address SLV mode */
        I2C_SET_CONTROL_REG(psI2CObj->u_i2c.i2c, I2C_CTL_SI | I2C_CTL_AA);

        psTransHandler->pfnTransIRQ = _I2C_SlaveRxTx_IRQ;

        if(psTransHandler->bHookIRQ == 0)
            I2C_EnableInt(psI2CObj->u_i2c.i2c);
    }

    uint32_t u32EndTick = mp_hal_ticks_ms() + u32TimeOut;

    while(1) {

        if(mp_hal_ticks_ms() > u32EndTick) {
            if((psTransPriv->u8State == 0) || (psTransPriv->u8State == 0xA0))
                break;
        }

        if(psTransPriv->u8EndFlag) {
//			printf("I2C slave end state %x \n", psTransPriv->u8State);
            break;
        }

        MICROPY_THREAD_YIELD();
    }

    if(psTransHandler->bHookIRQ == 0) {
        if(psI2CObj->bLPI2C) {
            LPI2C_DisableInt(psI2CObj->u_i2c.lpi2c);
        } else {
            I2C_DisableInt(psI2CObj->u_i2c.i2c);
        }
    }

    psTransHandler->psTransParam = NULL;
    psTransPriv->u8InTrans = 0;

    return psTransPriv->u32DataTrans;
}
